The parameter [Name] doesn't exist in the Family. It will be ignored.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FamilyParameterNoExist { get; }
  Visual Basic
Public Shared ReadOnly Property FamilyParameterNoExist As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FamilyParameterNoExist {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace